backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 3, 96, 96]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_1
      padding: !!python/tuple
      - !!python/tuple [3, 3]
      - !!python/tuple [3, 3]
      trainable: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: zero_padding2d_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [7, 7]
      name: conv1
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - zero_padding2d_1
        - 0
        - 0
        - {}
    name: conv1
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn1
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1
        - 0
        - 0
        - {}
    name: bn1
  - class_name: Activation
    config: {activation: relu, name: activation_1, trainable: true}
    inbound_nodes:
    - - - bn1
        - 0
        - 0
        - {}
    name: activation_1
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_2
      padding: !!python/tuple
      - !!python/tuple [1, 1]
      - !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - {}
    name: zero_padding2d_2
  - class_name: MaxPooling2D
    config:
      data_format: channels_first
      name: max_pooling2d_1
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - zero_padding2d_2
        - 0
        - 0
        - {}
    name: max_pooling2d_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2
      padding: valid
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_1
        - 0
        - 0
        - {}
    name: conv2
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv2
        - 0
        - 0
        - {}
    name: bn2
  - class_name: Activation
    config: {activation: relu, name: activation_2, trainable: true}
    inbound_nodes:
    - - - bn2
        - 0
        - 0
        - {}
    name: activation_2
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_3
      padding: !!python/tuple
      - !!python/tuple [1, 1]
      - !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - {}
    name: zero_padding2d_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv3
      padding: valid
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - zero_padding2d_3
        - 0
        - 0
        - {}
    name: conv3
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3
        - 0
        - 0
        - {}
    name: bn3
  - class_name: Activation
    config: {activation: relu, name: activation_3, trainable: true}
    inbound_nodes:
    - - - bn3
        - 0
        - 0
        - {}
    name: activation_3
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_4
      padding: !!python/tuple
      - !!python/tuple [1, 1]
      - !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_3
        - 0
        - 0
        - {}
    name: zero_padding2d_4
  - class_name: MaxPooling2D
    config:
      data_format: channels_first
      name: max_pooling2d_2
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - zero_padding2d_4
        - 0
        - 0
        - {}
    name: max_pooling2d_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: inception_3a_3x3_conv1
      padding: valid
      strides: &id002 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: inception_3a_3x3_conv1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: inception_3a_5x5_conv1
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: inception_3a_5x5_conv1
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3a_3x3_bn1
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3a_3x3_conv1
        - 0
        - 0
        - {}
    name: inception_3a_3x3_bn1
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3a_5x5_bn1
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3a_5x5_conv1
        - 0
        - 0
        - {}
    name: inception_3a_5x5_bn1
  - class_name: Activation
    config: {activation: relu, name: activation_4, trainable: true}
    inbound_nodes:
    - - - inception_3a_3x3_bn1
        - 0
        - 0
        - {}
    name: activation_4
  - class_name: Activation
    config: {activation: relu, name: activation_6, trainable: true}
    inbound_nodes:
    - - - inception_3a_5x5_bn1
        - 0
        - 0
        - {}
    name: activation_6
  - class_name: MaxPooling2D
    config:
      data_format: channels_first
      name: max_pooling2d_3
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: max_pooling2d_3
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_5
      padding: !!python/tuple
      - !!python/tuple [1, 1]
      - !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_4
        - 0
        - 0
        - {}
    name: zero_padding2d_5
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_6
      padding: !!python/tuple
      - !!python/tuple [2, 2]
      - !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - activation_6
        - 0
        - 0
        - {}
    name: zero_padding2d_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: inception_3a_pool_conv
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_3
        - 0
        - 0
        - {}
    name: inception_3a_pool_conv
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: inception_3a_3x3_conv2
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - zero_padding2d_5
        - 0
        - 0
        - {}
    name: inception_3a_3x3_conv2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5, 5]
      name: inception_3a_5x5_conv2
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - zero_padding2d_6
        - 0
        - 0
        - {}
    name: inception_3a_5x5_conv2
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3a_pool_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3a_pool_conv
        - 0
        - 0
        - {}
    name: inception_3a_pool_bn
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: inception_3a_1x1_conv
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: inception_3a_1x1_conv
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3a_3x3_bn2
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3a_3x3_conv2
        - 0
        - 0
        - {}
    name: inception_3a_3x3_bn2
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3a_5x5_bn2
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3a_5x5_conv2
        - 0
        - 0
        - {}
    name: inception_3a_5x5_bn2
  - class_name: Activation
    config: {activation: relu, name: activation_8, trainable: true}
    inbound_nodes:
    - - - inception_3a_pool_bn
        - 0
        - 0
        - {}
    name: activation_8
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3a_1x1_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3a_1x1_conv
        - 0
        - 0
        - {}
    name: inception_3a_1x1_bn
  - class_name: Activation
    config: {activation: relu, name: activation_5, trainable: true}
    inbound_nodes:
    - - - inception_3a_3x3_bn2
        - 0
        - 0
        - {}
    name: activation_5
  - class_name: Activation
    config: {activation: relu, name: activation_7, trainable: true}
    inbound_nodes:
    - - - inception_3a_5x5_bn2
        - 0
        - 0
        - {}
    name: activation_7
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_7
      padding: !!python/tuple
      - !!python/tuple [3, 4]
      - !!python/tuple [3, 4]
      trainable: true
    inbound_nodes:
    - - - activation_8
        - 0
        - 0
        - {}
    name: zero_padding2d_7
  - class_name: Activation
    config: {activation: relu, name: activation_9, trainable: true}
    inbound_nodes:
    - - - inception_3a_1x1_bn
        - 0
        - 0
        - {}
    name: activation_9
  - class_name: Concatenate
    config: {axis: 1, name: concatenate_1, trainable: true}
    inbound_nodes:
    - - - activation_5
        - 0
        - 0
        - &id003 {}
      - - activation_7
        - 0
        - 0
        - *id003
      - - zero_padding2d_7
        - 0
        - 0
        - *id003
      - - activation_9
        - 0
        - 0
        - *id003
    name: concatenate_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: inception_3b_3x3_conv1
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: inception_3b_3x3_conv1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: inception_3b_5x5_conv1
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: inception_3b_5x5_conv1
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3b_3x3_bn1
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3b_3x3_conv1
        - 0
        - 0
        - {}
    name: inception_3b_3x3_bn1
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3b_5x5_bn1
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3b_5x5_conv1
        - 0
        - 0
        - {}
    name: inception_3b_5x5_bn1
  - class_name: Activation
    config: {activation: relu, name: activation_10, trainable: true}
    inbound_nodes:
    - - - inception_3b_3x3_bn1
        - 0
        - 0
        - {}
    name: activation_10
  - class_name: Activation
    config: {activation: relu, name: activation_12, trainable: true}
    inbound_nodes:
    - - - inception_3b_5x5_bn1
        - 0
        - 0
        - {}
    name: activation_12
  - class_name: AveragePooling2D
    config:
      data_format: channels_first
      name: average_pooling2d_1
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [3, 3]
      trainable: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: average_pooling2d_1
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_8
      padding: !!python/tuple
      - !!python/tuple [1, 1]
      - !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_10
        - 0
        - 0
        - {}
    name: zero_padding2d_8
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_9
      padding: !!python/tuple
      - !!python/tuple [2, 2]
      - !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - activation_12
        - 0
        - 0
        - {}
    name: zero_padding2d_9
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: inception_3b_pool_conv
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - average_pooling2d_1
        - 0
        - 0
        - {}
    name: inception_3b_pool_conv
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: inception_3b_3x3_conv2
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - zero_padding2d_8
        - 0
        - 0
        - {}
    name: inception_3b_3x3_conv2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5, 5]
      name: inception_3b_5x5_conv2
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - zero_padding2d_9
        - 0
        - 0
        - {}
    name: inception_3b_5x5_conv2
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3b_pool_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3b_pool_conv
        - 0
        - 0
        - {}
    name: inception_3b_pool_bn
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: inception_3b_1x1_conv
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: inception_3b_1x1_conv
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3b_3x3_bn2
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3b_3x3_conv2
        - 0
        - 0
        - {}
    name: inception_3b_3x3_bn2
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3b_5x5_bn2
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3b_5x5_conv2
        - 0
        - 0
        - {}
    name: inception_3b_5x5_bn2
  - class_name: Activation
    config: {activation: relu, name: activation_14, trainable: true}
    inbound_nodes:
    - - - inception_3b_pool_bn
        - 0
        - 0
        - {}
    name: activation_14
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3b_1x1_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3b_1x1_conv
        - 0
        - 0
        - {}
    name: inception_3b_1x1_bn
  - class_name: Activation
    config: {activation: relu, name: activation_11, trainable: true}
    inbound_nodes:
    - - - inception_3b_3x3_bn2
        - 0
        - 0
        - {}
    name: activation_11
  - class_name: Activation
    config: {activation: relu, name: activation_13, trainable: true}
    inbound_nodes:
    - - - inception_3b_5x5_bn2
        - 0
        - 0
        - {}
    name: activation_13
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_10
      padding: !!python/tuple
      - !!python/tuple [4, 4]
      - !!python/tuple [4, 4]
      trainable: true
    inbound_nodes:
    - - - activation_14
        - 0
        - 0
        - {}
    name: zero_padding2d_10
  - class_name: Activation
    config: {activation: relu, name: activation_15, trainable: true}
    inbound_nodes:
    - - - inception_3b_1x1_bn
        - 0
        - 0
        - {}
    name: activation_15
  - class_name: Concatenate
    config: {axis: 1, name: concatenate_2, trainable: true}
    inbound_nodes:
    - - - activation_11
        - 0
        - 0
        - &id004 {}
      - - activation_13
        - 0
        - 0
        - *id004
      - - zero_padding2d_10
        - 0
        - 0
        - *id004
      - - activation_15
        - 0
        - 0
        - *id004
    name: concatenate_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: inception_3c_3x3_conv1
      padding: valid
      strides: &id005 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: inception_3c_3x3_conv1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: inception_3c_5x5_conv1
      padding: valid
      strides: *id005
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: inception_3c_5x5_conv1
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3c_3x3_bn1
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3c_3x3_conv1
        - 0
        - 0
        - {}
    name: inception_3c_3x3_bn1
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3c_5x5_bn1
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3c_5x5_conv1
        - 0
        - 0
        - {}
    name: inception_3c_5x5_bn1
  - class_name: Activation
    config: {activation: relu, name: activation_16, trainable: true}
    inbound_nodes:
    - - - inception_3c_3x3_bn1
        - 0
        - 0
        - {}
    name: activation_16
  - class_name: Activation
    config: {activation: relu, name: activation_18, trainable: true}
    inbound_nodes:
    - - - inception_3c_5x5_bn1
        - 0
        - 0
        - {}
    name: activation_18
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_11
      padding: !!python/tuple
      - !!python/tuple [1, 1]
      - !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_16
        - 0
        - 0
        - {}
    name: zero_padding2d_11
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_12
      padding: !!python/tuple
      - !!python/tuple [2, 2]
      - !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - activation_18
        - 0
        - 0
        - {}
    name: zero_padding2d_12
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: inception_3c_3x3_conv2
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - zero_padding2d_11
        - 0
        - 0
        - {}
    name: inception_3c_3x3_conv2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5, 5]
      name: inception_3c_5x5_conv2
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - zero_padding2d_12
        - 0
        - 0
        - {}
    name: inception_3c_5x5_conv2
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3c_3x3_bn2
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3c_3x3_conv2
        - 0
        - 0
        - {}
    name: inception_3c_3x3_bn2
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_3c_5x5_bn2
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_3c_5x5_conv2
        - 0
        - 0
        - {}
    name: inception_3c_5x5_bn2
  - class_name: MaxPooling2D
    config:
      data_format: channels_first
      name: max_pooling2d_4
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: max_pooling2d_4
  - class_name: Activation
    config: {activation: relu, name: activation_17, trainable: true}
    inbound_nodes:
    - - - inception_3c_3x3_bn2
        - 0
        - 0
        - {}
    name: activation_17
  - class_name: Activation
    config: {activation: relu, name: activation_19, trainable: true}
    inbound_nodes:
    - - - inception_3c_5x5_bn2
        - 0
        - 0
        - {}
    name: activation_19
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_13
      padding: !!python/tuple
      - !!python/tuple [0, 1]
      - !!python/tuple [0, 1]
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_4
        - 0
        - 0
        - {}
    name: zero_padding2d_13
  - class_name: Concatenate
    config: {axis: 1, name: concatenate_3, trainable: true}
    inbound_nodes:
    - - - activation_17
        - 0
        - 0
        - &id006 {}
      - - activation_19
        - 0
        - 0
        - *id006
      - - zero_padding2d_13
        - 0
        - 0
        - *id006
    name: concatenate_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: inception_4a_3x3_conv1
      padding: valid
      strides: *id005
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_3
        - 0
        - 0
        - {}
    name: inception_4a_3x3_conv1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: inception_4a_5x5_conv1
      padding: valid
      strides: *id005
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_3
        - 0
        - 0
        - {}
    name: inception_4a_5x5_conv1
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_4a_3x3_bn1
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_4a_3x3_conv1
        - 0
        - 0
        - {}
    name: inception_4a_3x3_bn1
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_4a_5x5_bn1
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_4a_5x5_conv1
        - 0
        - 0
        - {}
    name: inception_4a_5x5_bn1
  - class_name: Activation
    config: {activation: relu, name: activation_20, trainable: true}
    inbound_nodes:
    - - - inception_4a_3x3_bn1
        - 0
        - 0
        - {}
    name: activation_20
  - class_name: Activation
    config: {activation: relu, name: activation_22, trainable: true}
    inbound_nodes:
    - - - inception_4a_5x5_bn1
        - 0
        - 0
        - {}
    name: activation_22
  - class_name: AveragePooling2D
    config:
      data_format: channels_first
      name: average_pooling2d_2
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [3, 3]
      trainable: true
    inbound_nodes:
    - - - concatenate_3
        - 0
        - 0
        - {}
    name: average_pooling2d_2
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_14
      padding: !!python/tuple
      - !!python/tuple [1, 1]
      - !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - activation_20
        - 0
        - 0
        - {}
    name: zero_padding2d_14
  - class_name: ZeroPadding2D
    config:
      data_format: channels_first
      name: zero_padding2d_15
      padding: !!python/tuple
      - !!python/tuple [2, 2]
      - !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - activation_22
        - 0
        - 0
        - {}
    name: zero_padding2d_15
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: inception_4a_pool_conv
      padding: valid
      strides: *id005
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - average_pooling2d_2
        - 0
        - 0
        - {}
    name: inception_4a_pool_conv
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: inception_4a_3x3_conv2
      padding: valid
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - zero_padding2d_14
        - 0
        - 0
        - {}
    name: inception_4a_3x3_conv2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5, 5]
      name: inception_4a_5x5_conv2
      padding: valid
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - zero_padding2d_15
        - 0
        - 0
        - {}
    name: inception_4a_5x5_conv2
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_4a_pool_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_4a_pool_conv
        - 0
        - 0
        - {}
    name: inception_4a_pool_bn
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: inception_4a_1x1_conv
      padding: valid
      strides: *id005
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_3
        - 0
        - 0
        - {}
    name: inception_4a_1x1_conv
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_4a_3x3_bn2
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_4a_3x3_conv2
        - 0
        - 0
        - {}
    name: inception_4a_3x3_bn2
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: inception_4a_5x5_bn2
      scale: true
      trainable: true
    inbound_nodes:
    - - - inception_4a_5x5_conv2
        - 0
        - 0
        - {}
    name: inception_4a_5x5_bn2
  - class_name: Activation
    config: {activation: relu, name: activation_24, trainable: true}
    inbound_nodes:
    - - - inception_4a_pool_bn
        - 0
        - 0
        - {}
    name: activation_24
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
